Tekla Open API Reference for Tekla Structures 2025
Part.GetSolid Method
Overload List
Name | Description
GetSolid()
 Returns the solid of the part.
GetSolid(FormingStates)
 Returns the solid of the part.
GetSolid(Solid.SolidCreationTypeEnum)
 Returns the solid of the part.
Top
See Also
Reference
Part Class
Tekla.Structures.Model Namespace